Add lecture 5 and 6
